{
    "categories": {
        "0": "productivity"
    },
    "data_tracked": false,
    "description": "File Sharer was designed to allow you as a developer to share private files temporarily from the Bubble Database with external services when you need them without compromising on Privacy rules.\n\n📝 Docs here: https://djacklowcode.com/plugins/file-sharer/docs\n",
    "image": "//meta-q.cdn.bubble.io/f1715314779184x871247689229763300/File%20Sharer.png",
    "license": "open_source",
    "link": "https://amber-laser-7ba.notion.site/File-Sharer-Documentation-f066217ca51543d9ab9a6809308cf37b",
    "name": "File Sharer",
    "plugin_instructions": "Note that you will need A PAID BUBBLE PLAN TO USE THIS PLUGIN\n\nFile sharer works by leveraging Bubble's authentication of files through an app API key. This provides a temporary URL that can be accessed by anyone or service. This URL is pre-signed to expire within 5 minutes, but may exist for longer on the CDN\n\n\nUse cases:\n- Share temporary file access with trusted external services\n\nSteps to use:\n1 - Create an app API key in API settings\n2 - Add this to the Plugin settings\n3 - Set up an action with the plugin, providing urls to be pre-signed\n4 - use the result in follow on actions.\n\nThe plugin will return and error and continue the workflow if incorrect values are provided.\n\nSee the 'Documentation' link to the right for more info.\n\nNB:\n\nAs above, these urls/links can be accessed by anyone or service, so take care with how these are shared.\n\nAlways ensure that your workflows are set up so that only bubble file urls' are included in the workflows. This ensures requests aren't sent to an unknown service by users or endpoints, potentially exposing keys.\n\nYou can read more about pre-signed files here:\nhttps://docs.aws.amazon.com/AmazonS3/latest/userguide/using-presigned-url.html\n\nPlugin is free (so you can review code)\n\n📝 Docs here: https://djacklowcode.com/plugins/file-sharer/docs\n\n🔌 Other Plugins: https://djacklowcode.com/plugins/",
    "sa_node_version": 18
}